Revit 2024 API
IMultiServerService Interface
 The base interface class for all multi-server services.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public interface IMultiServerService : IExternalService
Visual Basic
Public Interface IMultiServerService _
	Inherits IExternalService
Visual C++
public interface class IMultiServerService : IExternalService
Remarks
 Both a single-server and multi-server service may have more than one server registered for them. The difference between these two kinds is while there can only be one active server at any given time for a single-sever service, there may be a whole set of active servers assigned for a multi-server service.
 When a multi-server service gets executed, the framework iterates through the set of currently active servers (application-wide or document-specific depending on the situation) and invokes the service's interface with a CanExecute call. If the service replies the current server cannot be executed, the framework skips it and continues with the next one in the queue. When a server is found it can be executed, the framework calls the service's interface again, this time with the Execute method. Whether the execution loop ends after the first executed server or not is controlled by execution policy, which is supplied for the service upon its registration.
See Also
IMultiServerService Members
Autodesk.Revit.DB.ExternalService Namespace